Repository: mlforcada/llibre-tecnol-trad
Catalog: llibrett/omegat/tm/memf.tmx
Source language: ca
Languages: es_es

source: Els continguts d'aquesta tercera part són, per tant, complementaris.
es_es: Los contenidos de esta tercera parte son, por lo tanto, complementarios.

source: Un gigaoctet té 1024 megaoctets, i un megaoctet, 1024 kilooctets: $1024 1024 = 1048576$.
es_es: Un gigabyte tiene 1024 megabytes, y un megabyte, 1024 kilobytes:

source: Programari
es_es: Software

source: Rússia
es_es: Rusia

source: Fes que l'acumulador (un registre de la memòria interna del processador) valga 1.
es_es: Haz que el acumulador (un registro de la memoria interna del procesador) valga 1.

source: Si és igual, salta a la instrucció Incrementa en 1 el valor de l'acumulador.
es_es: Si es igual, salta a la instrucción Incrementa en 1 el valor del acumulador.

source: Per exemple, la pantalla, el processador central, el teclat, els xips de memòria i les impressores.
es_es: Por ejemplo, la pantalla, el procesador central, el teclado, los chips de memoria y las impresoras.

source: Els sistemes poden ser també monousuari (MS-DOS, Windows 3.11) o multiusuari (Unix, VAX/VMS), si poden o no donar accés i suport a més d'un usuari alhora, o monotasca (MS-DOS) i multitasca (quasi tots els altres), si poden o no executar més d'un programa alhora.
es_es: Los sistemas pueden ser también monousuario (MS-DOS, Windows 3.11) o multiusuario (Unix, VAX/VMS), si pueden o no dar acceso y apoyo además de un usuario a la vez, o monotarea (MS-DOS) y multitarea (casi todos los otros), si pueden o no ejecutar más de un programa a la vez.

source: Vegeu el capítol . [Programes de gràfics,] que ens ajuden a presentar de manera més útil les dades de què disposem (aquests programes apareixen moltes voltes associats a fulls de càlcul).
es_es: Ver el capítulo . [Programas de gráficos,] que nos ayudan a presentar de manera más útil los datos de los que disponemos (estos programas aparecen muchas veces asociados a hojas de cálculo).

source: Heus ací una llista d'algunes de les coses que sabem que ens queden a fer: Potser s'ha de millorar una miqueta el capítol que tracta sobre conceptes bàsics de la informàtica. També hi falten referències bibliogràfiques.
es_es: He aquí una lista de algunas de las cosas que sabemos que nos quedan por hacer: Quizás se tiene que mejorar un poco el capítulo que trata sobre conceptos básicos de la informática. También faltan referencias bibliográficas.

source: Quanta memòria ocupa una imatge de 1024 per 1024 punts on cada punt pot tenir 8 colors?
es_es: \item ¿Cuánta memoria ocupa una imagen de 1024 por 1024 puntos donde cada punto puede tener 8 colores?

source: Una estructura que conté els noms d'altres fitxers.
es_es: \item Una estructura que contiene los nombres de otros ficheros.

source: [PCMCIA] (de l'anglés Personal Computer Memory Card International Association, associació internacional de targetes de memòria per a ordinadors personals): nom d'un estàndard de targetes de memòria, mòdems, discos, unitats de disquets, targetes de xarxa i altres dispositius perifèrics per a ordinadors portàtils.
es_es: [PCMCIA] (del inglés Personal Computer Memory Card International Association, asociación internacional de tarjetas de memoria para ordenadores personales): nombre de un estándar de tarjetas de memoria, módems, discos, unidades de disquets, tarjetas de red y otros dispositivos periféricos para ordenadores portátiles.

source: Per exemple, actualment és comú que un PC tinga un processador AMD ATHLON 64 X2 Dual-Core (vegeu el glossari, apartat ) a 2 GHz o un processador equivalent de la marca Intel (p.e., un Intel Pentium D 925 a 3 GHz), 1 GB de memòria RAM i uns 80 GB de disc dur.
es_es: Por ejemplo, actualmente es común que un PC tenga un procesador AMD ATHLON 64 X2 Dual-Core (mirad el glosario, apartado ) a 2 GHz o un procesador equivalente de la marca Intel (p.e., un Intel Pentium D 925 a 3 GHz), 1 GB de memoria RAM y unos 80 GB de disco duro.

source: Tota la informació ---instruccions de programa o dades--- que s'emmagatzema en la memòria d'un ordinador s'hi guarda en forma binària; és a dir, cada dada és una cadena de dígits binaris o bits.
es_es: Toda la información ---instrucciones de programa o datos--- que se almacena en la memoria de un ordenador se guarda de forma binaria; es decir, cada dato es una cadena de dígitos binarios o bits.

source: Que tenen en comú els primers octets.
es_es: Que tienen en común los primeros bytes.

source: En discos grans, seria molt incòmode tenir tots els fitxers un darrere l'altre; per això, és comú que els fitxers estiguen organitzats en { directoris}.
es_es: En discos grandes, sería muy incómodo tener todos los ficheros uno detrás del otro; por eso, es normal que los ficheros estén organizados en { directorios}.

source: Aquestes targetes no són massa diferents en grandària d'una targeta de crèdit i s'insereixen en el port corresponent de l'ordinador, amb la peculiaritat que en permeten l'inserció i l'extracció ``en calent'', és a dir, sense haver d'apagar l'ordinador.
es_es: Estas tarjetas no son muy diferentes en tamaño a una tarjeta de crédito y se insertan en el puerto correspondiente del ordenador, con la peculiaridad que permiten la inserción y extracción ``en caliente'', es decir, sin tener que apagar el ordenador.

source: Windows usa les extensions dels noms de fitxers per a{}
es_es: \item Windows usa las \emph{extensiones} de los nombres de ficheros para{\ldots}

source: (a).
es_es: \item (a).

source: Què es pot dir dels números IP de dues màquines que es troben en la mateixa subxarxa?
es_es: ¿Qué se puede decir de los números IP de dos máquinas que se encuentran en la misma subred?

source: on A[p] representa el caràcter que hi ha en la posició p de la seqüència A.
es_es: on A[p] representa el caracter que hay en la posición p de la secuencia A.

source: Fins fa poc la denominació usual era URL, uniform resource locator o localitzador uniforme de recursos, que encara s'usa profusament.
es_es: Hasta hace poco la denominación usual era URL, uniform resource locator o localizador uniforme de recursos, que todavía se usa muy a menudo.

source: Aquest matemàtic va introduir el sistema decimal hindú en el món àrab.
es_es: Este matemático introdujo el sistema decimal hindú en el mundo árabe.

source: Amb 8 bits podem fer \(2^8=22 2 2 2 2 2 2=256\) combinacions.Per tant, es necessiten 8 bits, és a dir, un octet.
es_es: Por lo tanto, se necesitan 8 bits, es decir, un byte.

source: (b).
es_es: \item (b).

source: Una d'aquestes tres no pot ser la velocitat del seu mòdem: 9600 bits per segon 57600 bits per segon 38400 bits per segon
es_es: Una de estas tres \emph{no} puede ser la velocidad de su módem: \begin{enumerate} \item 9600 bits por \item segundo 57600 bits por \item segundo 38400 bits por segundo \end{enumerate}

source: [Servidors:] Els servidors són ordinadors que contenen i gestionen informació que s'utilitzarà en d'altres ordinadors (``clients'') connectats a ells a través d'una xarxa interna o a través d'Internet; no són massa diferents d'un ordinador de sobretaula, típicament més potents quant a memòria, disc i processador, però, com que ningú ha de seure davant d'ells no solen tenir pantalles, teclats o ratolins.
es_es: [Servidores:] Los servidores son ordenadores que contienen y gestionan información que se utilizará en otros ordenadores (``clientes'') conectados a ellos a través de una red interna o a través de Internet; no son muy diferentes a un ordenador de sobremesa, normalmente más potentes en cuanto a memoria, disco y procesador, pero, como nadie tiene que sentarse frente a ellos no suelen tener pantallas, teclados o ratones.

source: Els directoris són fitxers especials que agrupen els noms i les característiques d'altres fitxers; de fet, els directoris poden contenir zero o més fitxers o també zero o més directoris (sense restriccions de quantitat), i així successivament, de manera que la persona usuària pot establir una estructuració jeràrquica o arbòria dels seus fitxers en el disc.
es_es: Los directorios son ficheros especiales que agrupan los nombres y las características de otros ficheros; de hecho, los directorios pueden contener cero o más ficheros o también cero o más directorios (sin restricciones de cantidad), y así sucesivamente, de manera que el usuario puede establecer una estructuración jerárquica o en forma de árbol de sus ficheros en el disco.

source: Durant el temps de la connexió, el proveïdor d'Internet assigna un número IP temporal al nostre ordinador domèstic, de manera que forme part d'Internet i puga accedir com a client a tots els serveis i documents disponibles en qualsevol màquina de la xarxa, però normalment no com a servidor.
es_es: Durante el tiempo de conexión, el proveedor de Internet asigna un número IP temporal a nuestro ordenador doméstico, de manera que forma parte de Internet y puede acceder como cliente, a todos los servicios y documentos disponibles en cualquier máquina de la red, pero normalmente no como servidor.

source: El Pentium original ha anat evolucionant durant els últims anys: Pentium Pro, Pentium II, Pentium III, Pentium 4 etc.
es_es: El Pentium original ha ido evolucionando durante los últimos años:

source: {Programes i algorismes:} Moltes voltes, un programa és la realització (entre informàtics se'n diu { implementació}) d'un algorisme.
es_es: {Programas y algoritmos:} Muchas veces, un programa es la realización (entre informáticos se dice { implementación}) de un algoritmo.

source: El dispositiu d'entrada més comú és el teclat.
es_es: El dispositivo de entrada más común es el teclado.

source: No, perquè només s'hi ha guardat el sistema operatiu.
es_es: \item No, porque sólo se ha guardado el sistema operativo.

source: Es pot trobar una còpia d'aquesta llicència en {http://ca.dodds.net/gnu/gpl.ca.html}.
es_es: Se puede encontrar una copia de esta licencia en {http://ca.dodds.net/gnu/gpl.ca.html}.

source: Per exemple, els caràcters i símbols més comunament usats en textos se solen guardar cada un en un octet, usant el codi ASCII (American Standard Code for Information Interchange), on el codi de la ``{ A}'' és ``{ 01000001}'' o el de la ``{ z}'' és ``{ 01111010}'' (vegeu l'epígraf ).
es_es: Por ejemplo, los caracteres y símbolos más comúnmente usados en textos se suelen guardar cada uno en un byte, usando el código ASCII (American Standard Code for Information Interchange), donde el código de la ``{ A}'' és ``{ 01000001}'' o el de la ``{ z}'' es ``{ 01111010}'' (ver el epígrafo ).

source: També és possible, si el nostre proveïdor de correu ho permet, accedir al correu electrònic des de qualsevol lloc usant un navegador, a través d'una pàgina web anomenada webmail; són comuns els webmails gratuïts (Yahoo, Mixmail, Hotmail); cada alumna o alumne de la Universitat d'Alacant té, per ser-ho, una adreça de correu de la forma xxx@alu.ua.es, accessible a través de la secció webmail del servidor de la Universitat.
es_es: También es posible, si nuestro proveedor de correo lo permite, acceder al correo electrónico desde cualquier lugar usando un navegador, a través de una página web llamada webmail; son comunes los webmails gratuitos (Yahoo, Mixmail, Hotmail); cada alumna o alumno de la Universidad de Alicante tiene, para pertenecer a la misma, una dirección de correo de la forma xxx@alu.ua.es, accesible a través de la sección webmail del servidor de la universidad.

source: França
es_es: Francia

source: Una estructura de dades que representa el text generat per un processador de textos i que té un nom associat.
es_es: \item Una estructura de datos que representa el texto generado por un procesador de textos y que tiene un nombre asociado.

source: Una adreça de correu electrònic.
es_es: Una dirección de correo electrónico.

source: Per a poder emmagatzemar el color cal un nombre de bits suficient per a fer 256 combinacions.
es_es: Para poder almacenar el color hace falta un número de bits suficiente para hacer 256 combinaciones.

source: En qualsevol disc (disquet, dur, CD-ROM) sempre hi ha un directori especial que es diu arrel.
es_es: \begin{enumerate} \item En cualquier disco (disquete, disco duro, CD-ROM) siempre hay un directorio especial que se llama raíz.

source: No, només instruccions per a invocar els corresponents programes del sistema operatiu Sí, perquè formen part de l'algorisme principal Sí, perquè, si no, no les podrien executar Dins d'una carpeta (directori) podem posar carpetes i documents (fitxers) mesclats?
es_es: ¿Quiere decir esto que tanto un navegador, como un procesador de textos o una memoria de traducción contienen instrucciones de programa para ejecutar estas operaciones básicas?

source: {} fa les dues coses.
es_es: \item {\ldots} hace las dos cosas.

source: [DSL] (de l'anglés digital subscriber line, línia d'abonat digital), Tecnología de connexió que permet aprofitar les línies telefòniques i elèctriques per a fer connexions d'alta velocitat (des dels 128 kbps fins als 2 Mbps).
es_es: [DSL] (del inglés digital subscriber line, línea de abonado digital), Tecnología de conexión que permite aprovechar las líneas telefónicas y eléctricas para hacer conexiones de alta velocidad (desde los 128 kbps hasta los 2 Mbps).

source: Són programes que permeten accedir de manera senzilla als documents o serveis d'Internet en ordinadors connectats a aquesta xarxa; entre altres coses, els navegadors interpreten els hipertextos escrits en HTML i els presenten a la persona usuària en el format que indiquen les marques, de manera que els enllaços a altres hipertextos queden clarament destacats i siguen actius, és a dir, que responguen a un clic del ratolí saltant a l'hipertext enllaçat.
es_es: Son programas que permiten acceder de manera sencilla a los documentos o servicios de Internet en ordenadores conectados a esta red; entre otras cosas, los navegadores interpretan los hipertextos escritos en HTML y los presentan a la persona usuaria en el formato que indican las marcas, de forma que los enlaces a otros hipertextos quedan claramente destacados y están activos, es decir, que responden a un clic del ratón saltando al hipertexto enlazado.

source: D'altra banda, el sistema operatiu ofereix serveis bàsics (vegeu més avall) als programes d'aplicació que s'executen en l'ordinador (els quals poden tenir la seua pròpia interfície d'ús).
es_es: Por otro lado, el sistema operativo ofrece servicios básicos (ver más abajo) en los programas de aplicación que se ejecutan en el ordenador (los cuales pueden tener su propia interfaz de uso).

source: Els navegadors més usats són Microsoft Internet Explorer (empaquetat, no sense polèmiques legals, amb moltes versions del sistema operatiu Windows), Mozilla (un programa gratuït i obert desenvolupat per centenars de col·laboradors arreu del món) i Netscape.
es_es: Los navegadores más usados son Microsoft Internet Explorer (empaquetado, no sin polémicas legales, con muchas versiones del sistema operativo Windows), Mozilla (un programa gratuito y abierto desarrollado por centenares de colaboradores en todo el mundo) y Netscape.

source: Els professors d'Informàtica Aplicada a la Traducció només considerem vàlids els missatges que provenen d'aquestes adreces oficials.
es_es: Los profesores de Informática Aplicada a la Traducción sólo consideramos válidos los mensajes que provienen de estas direcciones oficiales.

source: Hi ha continguts ---diguem-ne millor habilitats--- que s'aprenen com a part de les sessions de laboratori i que no figuren en aquest document.
es_es: Hay contenidos ---digamos mejor habilitados--- que se aprenden como parte de las sesiones de laboratorio y que no figuran en este documento.

source: També és possible (i molt còmoda) la connexió sense fils (vegeu Wi-Fi en aquest glossari).
es_es: También es posible (y muy cómoda) la conexión inalámbrica (ver \emph{Wi-Fi} en este glosario).

source: Com ja s'ha dit més amunt, un programari és un conjunt de programes, cada un dels quals consisteix en una llista d'instruccions vàlides (executables per l'ordinador) que s'executen en l'ordre indicat, de la primera a l'última, excepte quan s'hi presenta alguna instrucció de salt que indica quina és la següent instrucció que s'ha d'executar.
es_es: Como ya se ha dicho más arriba, un software es un conjunto de programas, cada uno de los cuales consiste en una lista de instrucciones válidas (ejecutables por el ordenador) que se ejecutan en el orden indicado, de la primera a la última, excepto cuando se presenta alguna instrucción de salto que indica cuál es la siguiente instrucción que se tiene que ejecutar.

source: De fet, com en el cas dels kilooctets, no exactament: $$1 MB = 1.024 1.024 octets= 1.048.576 octets.$$ gigaoctets o gigabytes (GB), o milers de milions ---una mica més--- d'octets: $$1 GB=1.024 MB=1.048.576 kB=1.073.741.824 octets.$$
es_es: De hecho , como en el caso de los kilobytes, no exactamente: $$1 MB = 1.024 1.024 bytes= 1.048.576 bytes.$$ gigabytes (GB), o miles de millones ---un poco más--- de bytes: $$1 GB=1.024 MB=1.048.576 kB=1.073.741.824 bytes.$$

source: [Processament:] Els dispositius de processament són els que fan realment el treball.
es_es: [Procesamiento:] Los dispositivos de procesamiento son los que hacen realmente el trabajo.

source: [Maquinari] (o hardware): l'equipament físic que es pot veure i tocar.
es_es: Hardware): el equipamiento físico que se puede ver y tocar.

source: Si la màquina |fictici.deconya.ua.es| té el número IP |232.111.22.33| quin dels tres número IP següents és més probable que corresponga a la màquina |fals.deconya.ua.es|?
es_es: Si la máquina |fictici.deconya.ua.es| tiene el número IP |232.111.22.33| ¿cuál de los tres número IP siguientes es más probable que corresponda a la máquina |fals.deconya.ua.es|?

source: Ordinadors i programes
es_es: Ordenadores y programas

source: Sí.
es_es: \item Sí.

source: Els disquets, els discos fixos i les cintes són dispositius d'emmagatzematge magnètic, poc més o menys com ho són les cassets.
es_es: Los disquetes, los discos fijos y las cintas son dispositivos de almacenamiento magnético, poco más o menos como lo son las casetes.

source: En les unitats de CD-ROM és important la velocitat màxima de transferència de dades, que es dóna com a múltiple de l'estàndard (la d'un CD de música, de l'ordre d'uns 150 kilooctets per segon): quàdrupla (4$$), sèxtupla (6$$), etc.
es_es: En las unidades de CD-ROM es importante la velocidad máxima de transferencia de datos, que se da como múltiple del estándar (la de un CD de música, del orden de unos 150 kilobytes por segundo): cuádruple (4$$), séxtuple (6$$), etc.

source: Qui té raó?
es_es: ¿Quién tiene razón?

source: Una velocitat de 3 kilooctets per segon equival a uns $3000 8=24000$ bits per segon.
es_es: Una velocidad de 3 kilobytes por segundo equivale a unos $3000\times 8=24000$ bits por segundo \item (b).

source: (a) (b) (a) (b)
es_es: \item (a) \item (b) \item (a) \item (a):

source: Per exemple, un nom podria ser { altea.dlsi.ua.es}, on { altea} es refereix a una màquina concreta del Departament de Llenguatges i Sistemes Informàtics ({ dlsi}) de la Universitat d'Alacant ({ ua}), que es troba a Espanya ({ es}) (en això els noms s'assemblen a les adreces postals: primer es dóna el més concret i al final el país; aquest ordre és l'invers al dels números IP).
es_es: Por ejemplo, un nombre podría ser { altea.dlsi.ua.es}, donde { altea} se refiere a una máquina concreta del Departamento de Lenguajes y Sistemas Informáticos ({ dlsi}) de la Universidad de Alicante ({ ua}), que se encuentra en España ({ es}) (en esto los nombres se asemejan a las direcciones de correo: primero se da el más concreto, y al final, el país; este orden es el inverso al de los números IP).

source: Per tant, la pantalla ocupa 1024?1024?3=3.145.728 bits, que són 3.145.728/8=393.216 octets, que són 393.216/1024=384 kilooctets.
es_es: Por lo tanto, la pantalla ocupa 1024?1024?3=3.145.728 bits, que son 3.145.728/8=393.216 bytes, que son 393.216/1024=384 kilobytes.

source: El fitxer que conté l'hipertext s'anomena { index.html} (on les sigles HTML corresponen a hypertext markup language, nom del llenguatge o sistema de marques més usat per a donar format als hipertextos, descrit en l'epígraf ).
es_es: Un URI tiene generalmente dos partes, aunque se dan algunas variaciones: el esquema, que indica la clase de recurso y cómo lo tiene que usar el ordenador solicitado (o cliente) el nombre del recurso, que a menudo está formado por: el nombre del ordenador servidor o su número IP (opcionalmente) información sobre la localización del servicio o documento dentro del ordenador servidor (muchas veces similar a las trayectorias de los ficheros, p. ) Por ejemplo, el URI {http://www.canalcuina.tv/concurs/sms/index.html} se refiere a un documento de hipertexto ---un documento de texto que contiene enlaces que permiten acceder directamente a otros hipertextos relacionados--- compatible con el esquema { http} (hypertext transfer protocol o protocolo de transferencia de hipertextos) situado en el ordenador { www.canalcuina.tv} (de la empresa ficticia Canal Cocina, posiblemente perteneciente al mundo de la televisión, y, dentro de este, en el directorio { público}, subdirectorio { sms}.

source: Sobre algorismes
es_es: Sobre algoritmos

source: Altres termes habituals són CD-R ---que identifica els CD en què podem emmagatzemar informació només una vegada amb l'ajuda de dispositius coneguts com a enregistradores--- i CD-RW ---utilitzat per als CD que poden ser esborrats i reescrits un nombre il·limitat de vegades.
es_es: Otras términos habituales son CD-R ---que identifica los CD en que podemos almacenar información sólo una vez con la ayuda de dispositivos conocidos como enregistradores--- y CD-RW ---utilizado para los CD que pueden ser borrados y reescritos un número ilimitado de veces.

source: [Fulls de càlcul,] que permeten automatitzar càlculs que es repeteixen sobre un conjunt més o menys gran de dades (per exemple, per a calcular la nota mitjana de cada estudiant d'una classe sencera a partir de les notes parcials), i presentar-ne els resultats de diverses maneres, per exemple, en gràfics de molts tipus.
es_es: [Hojas de cálculo,] que permiten automatizar cálculos que se repiten sobre un conjunto más o menos grande de datos (por ejemplo, para calcular la nota media de cada estudiante de una clase entera a partir de las notas parciales), y presentar los resultados de varias maneras, por ejemplo, en gráficos de muchos tipos.

source: S'anomena firmware el programari del sistema que s'usa tan freqüentment que s'emmagatzema permanentment en xips ROM.
es_es: Se denomina firmware el software del sistema que se usa de forma tan frecuente que se almacena permanentemente en chips ROM.

source: {Indicatius d'Internet d'alguns països.
es_es: {Indicativos de Internet de algunos países.

source: Configuració d'un ordinador personal
es_es: Configuración de un ordenador personal.

source: Solucions
es_es: Soluciones

source: Se n'ha de considerar la resolució, és a dir, el nombre de punts, elements d'imatge (píxels) que caben en una imatge, per exemple $1024 768$ (horitzontal $$ vertical), i altres paràmetres com la { freqüència de refrescament} (que es mesura en hertzs o cicles per segon; vegeu ``megahertz'').
es_es: Hay que tener en cuenta la resolución, es decir, el número de puntos, elementos de imagen (píxels) que caben en una imagen, por ejemplo $1024 768$ (horizontal $$ vertical), i otros parámetros como la { frecuencia de refrescamiento} (que se mide en herzios o ciclos por segundo; ver "megaherzio'').
